#+title: Roadmap

#+BEGIN: clocktable :scope file :maxlevel 2 :link t
#+CAPTION: Clock summary at [2023-10-20 Fri 08:01]
| Headline                       | Time   |      |
|--------------------------------+--------+------|
| *Total time*                   | *3:31* |      |
|--------------------------------+--------+------|
| [[file:/Users/dbaker/src/cpprl/roadmap.org::*v0.1.0: Complete The Tutorials][v0.1.0: Complete The Tutorials]] | 3:31   |      |
| \_  [[file:/Users/dbaker/src/cpprl/roadmap.org::*\[\[https://github.com/daniebker/cpprl/issues/6\]\[#6\]\] Ranged Scrolls][#6 Ranged Scrolls]]          |        | 3:31 |
#+END:


* STRT v0.1.0: Complete The Tutorials
** STRT [[https://github.com/daniebker/cpprl/issues/6][#6]] Ranged Scrolls
:LOGBOOK:
CLOCK: [2023-10-22 Sun 15:07]
CLOCK: [2023-10-22 Sun 10:44]--[2023-10-22 Sun 14:46] =>  4:02
- Finally got it working.
CLOCK: [2023-10-22 Sun 10:04]--[2023-10-22 Sun 10:43] =>  0:39
- Break. Renaming and moving files around.
CLOCK: [2023-10-19 Thu 18:30]--[2023-10-19 Fri 20:55] =>  2:25
- Craching on select tiles
CLOCK: [2023-10-16 Mon 13:40]--[2023-10-16 Mon 14:46] =>  1:06
- Add LightningBolt class as a consumable item. Passing the engine from the command to the consumable.
:END:

- [[https://rogueliketutorials.com/tutorials/tcod/v2/part-9/][python tutorial]]
- [[https://www.roguebasin.com/index.php/Complete_roguelike_tutorial_using_C%2B%2B_and_libtcod_-_part_9:_spells_and_ranged_combat][roguebasin]]
** TODO [[https://github.com/daniebker/cpprl/issues/5][#5]] Inventory not scrolling
** DONE [[https://github.com/daniebker/cpprl/issues/8][#8]] Fix permissions issue when publishing a release
:LOGBOOK:
- State "DONE"       from "STRT"       [2023-10-16 Mon 13:43]
:END:
- tried adding ~permissions:~ but it still failed.
** TODO [[https://github.com/daniebker/cpprl/issues/4][#4]]
** TODO [[https://github.com/daniebker/cpprl/issues/3][#3]]
** TODO [[https://github.com/daniebker/cpprl/issues/2][#2]]
** TODO [[https://github.com/daniebker/cpprl/issues/1][#1]]
** TODO [[https://github.com/daniebker/cpprl/issues/7][#7]] fix emscripten build

* Someday

**
